// LAB-8.2.cpp
// Сушинський Ігор
// Лабораторна робота №8.2
// Опрацювання літерних рядків.
// Варіант 18

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <string>
#include <Windows.h>

using namespace std;

int Length(string& s)
{
	int k = 0; // довжина слова
	int min = 0; // мінімальне значення

	for (int i = 0; i < s.length(); i++)
	{
		k++;											// лічильник довжини слова
		if ((s[i + 1] == ' ') || (s[i + 1] == '\0'))	// якщо наступний символ пробіл або нуль-символ
		{
			if (min == 0)								// якщо min=0 — це значить, що я знайшов перше слово та
				min = k;								// мінімальним значенням за замовчуванням буде довжина першого слова
			if (k < min)
				min = k;								// якщо довжина слова менше min, то присвоюєм нове значення для min
			k = -1;										// обнуляємо довжину слова. -1, тому що наступний символ у циклі це
		}												// пробіл, а його рахувати не треба
	}
	return min;
}

int main()
{
	SetConsoleCP(1251); // встановлення сторінки win-cp1251 в потік вводу
	SetConsoleOutputCP(1251); // встановлення сторінки win-cp1251 в потік виводу

	string s;

	cout << "Ввести лiтерний рядок:" << endl;
	getline(cin, s);

    cout << "Довжина найкоротшого слова = " << Length(s) << endl;

    return 0;
}